In [1]:
import sqlite3
import pandas as pd

In [2]:
#q1 在当前目录创建一个名为grade.db的数据库文件，并用sqlite3 module创建与文件的连接

In [2]:
conn = sqlite3.connect("grade.db")

In [4]:
#q2 创建一个表格记录学生成绩信息，需要包括：学号  姓名  成绩 科目四列

In [3]:
cursor = conn.cursor()
sql = "create table student(id int, name text, grade int, subject text)"
cursor.execute(sql)

In [ ]:
#q3 向表中插入20条数据, 至少包括如下一条：
# 101 张三 -1 语文

In [4]:
insert into table_name values (101, "张三", -1, "语文")
"insert into table_name values (?,?,?,?)", 101, "张三", -1, "语文" 
insert into table_name (xuehao, xingming) values ('101', '张三')

SyntaxError: invalid syntax (<ipython-input-4-2bbfa662b6ed>, line 1)

In [5]:
data = [(101, "张三", -1, "语文"),
        (202, "李四", 0, "数学"),
        (0, "程0峰", 100, "人体科学"),
        (0, "程0峰", -5, "我为什么还没有男朋友"),
        (1, "景晨", 1, "我为什么还没有男朋友"),
        (100, "将以滚", 0, "老女人的自我修养")
       ]
#conn = sqlite3.connect("grade.db")
conn.executemany("insert into student values (?,?,?,?)", data)

In [12]:
conn.commit()

In [ ]:
#q4 查询人体科学成绩大于60分的学生的姓名和对应科目

In [6]:
cursor = conn.cursor()
cursor.execute("select name, subject from student where subject == '人体科学' and grade > 60")
values = cursor.fetchall()

In [7]:
print(values)

[('程0峰', '人体科学')]

In [ ]:
#q5 查询平均成绩小于60分的学生的姓名和学号

In [8]:
cursor.execute("select name, id, avg(grade) as a from student group by id having a < 60")
clf = cursor.fetchall()
print(clf)

[('程0峰', 0, 47.5), ('景晨', 1, 1.0), ('将以滚', 100, 0.0), ('张三', 101, -1.0), ('李四', 202, 0.0)]

In [ ]:
#q6 把成绩小于60分的学生的成绩根据如下公式修改成绩：
#   新成绩 = sqrt(原成绩) * 10

In [9]:
import numpy as np

In [13]:
df = pd.read_sql("select * from student", conn)
df["grade"] = np.sqrt(df["grade"]) * 10
df

    id name  grade     subject
0  101   张三    NaN          语文
1  202   李四    0.0          数学
2    0  程0峰  100.0        人体科学
3    0  程0峰    NaN  我为什么还没有男朋友
4    1   景晨   10.0  我为什么还没有男朋友
5  100  将以滚    0.0    老女人的自我修养

In [14]:
df.to_sql("student", conn, schema = "create table student(id int, name text, grade int, subject text)",
          if_exists="replace", index=False)
conn.commit()

In [ ]:
#q7 查询姓“张”的人的所有信息

In [16]:
pd.read_sql("SELECT * from student where name like '张%' ", conn)

    id name grade subject
0  101   张三  None      语文

In [ ]:
SELECT name, xuehao, grade from tb where name glob '张?'
SELECT name, xuehao, grade from tb where name glob '*张?'
SELECT name, xuehao, grade from tb where name like '张_'
SELECT name, xuehao, grade from tb where name like '%张_'

In [ ]:
#q8 将成绩小于0的记录中的成绩改为0

In [ ]:
update student set grade = 0 where grade < 0

In [ ]:
#q9 删除成绩为0的记录

In [ ]:
delete from student where grade = 0

In [ ]:
#q10 再创建一个学生性别表，包含学号 性别 两列，并练习外键约束

In [ ]:
DELETE from tb where grade = 0

In [ ]:
update tb set grade = 0 where grade <0